zhang-stephen/Chip-Support-Library/System/inc/kinetis_keaz128xxx4.h
/*
** End of section using anonymous unions
*/

#if defined(__CC_ARM)
  #pragma pop
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic pop
#elif defined(__CWCC__)
  #pragma pop
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


/* ----------------------------------------------------------------------------
   -- Backward Compatibility
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Backward_Compatibility_Symbols Backward Compatibility
 * @{
 */

#define NVIC_ISER_SETENA_MASK        This_symbol_has_been_deprecated
#define NVIC_ISER_SETENA_SHIFT       This_symbol_has_been_deprecated
#define NVIC_ISER_SETENA(x)          This_symbol_has_been_deprecated
#define NVIC_ICER_CLRENA_MASK        This_symbol_has_been_deprecated
#define NVIC_ICER_CLRENA_SHIFT       This_symbol_has_been_deprecated
#define NVIC_ICER_CLRENA(x)          This_symbol_has_been_deprecated
#define NVIC_ISPR_SETPEND_MASK       This_symbol_has_been_deprecated
#define NVIC_ISPR_SETPEND_SHIFT      This_symbol_has_been_deprecated
#define NVIC_ISPR_SETPEND(x)         This_symbol_has_been_deprecated
#define NVIC_ICPR_CLRPEND_MASK       This_symbol_has_been_deprecated
#define NVIC_ICPR_CLRPEND_SHIFT      This_symbol_has_been_deprecated
#define NVIC_ICPR_CLRPEND(x)         This_symbol_has_been_deprecated
#define SCB_ICSR_VECTACTIVE_MASK     This_symbol_has_been_deprecated
#define SCB_ICSR_VECTACTIVE_SHIFT    This_symbol_has_been_deprecated
#define SCB_ICSR_VECTACTIVE(x)       This_symbol_has_been_deprecated
#define SCB_ICSR_ISRPENDING_MASK     This_symbol_has_been_deprecated
#define SCB_ICSR_ISRPENDING_SHIFT    This_symbol_has_been_deprecated
#define INT_LVD_LVW                INT_PMC
#define INT_ADC0                   INT_ADC
#define INT_Watchdog               INT_WDOG
#define MSCAN_TDLR_DLC_MASK        MSCAN_TDLR_TDLC_MASK
#define MSCAN_TDLR_DLC_SHIFT       MSCAN_TDLR_TDLC_SHIFT
#define MSCAN_TDLR_DLC(x)          MSCAN_TDLR_TDLC(x)

/*!
 * @}
 */ /* end of group Backward_Compatibility_Symbols */


#else /* #if !defined(MCU_SKEAZ1284) */
  /* There is already included the same memory map. Check if it is compatible (has the same major version) */
  #if (MCU_MEM_MAP_VERSION != 0x0100u)
    #if (!defined(MCU_MEM_MAP_SUPPRESS_VERSION_WARNING))
      #warning There are included two not compatible versions of memory maps. Please check possible differences.
    #endif /* (!defined(MCU_MEM_MAP_SUPPRESS_VERSION_WARNING)) */
  #endif /* (MCU_MEM_MAP_VERSION != 0x0100u) */
#endif  /* #if !defined(MCU_SKEAZ1284) */

/* SKEAZ1284.h, eof. */
